Repository: Ibra-himAbdo/StudentAffairs.Session18
Catalog: StudentAffairs.Server/Resources/Resource.*.resx
Languages: ar

source: Hello
ar: مرحبًا

source: MenuHome
ar: الرئيسية

source: Name
ar: الاسم

source: Department
ar: القسم

source: Male
ar: ذكر

source: Female
ar: انثى

source: Gender
ar: النوع

source: Mobile
ar: الهاتف المحمول

source: Date Of Birth
ar: تاريخ الميلاد

source: Level
ar: المستوى

source: More Details
ar: المزيد من المعلومات

source: StudentsGrid
ar: جدول الطلاب

source: DepartmentsGrid
ar: جدول الاقسام

source: ProfessorsGrid
ar: جدول الأساتذة

source: Code
ar: الكود

source: Credits
ar: الاعتماد

source: CoursesGrid
ar: جدول الدورات

source: Students
ar: الطلاب

source: Courses
ar: الدورات

source: Professors
ar: الأساتذة

source: Departments
ar: الاقسام

source: Full Name Validation
ar: الاسم الكامل مطلوب.

source: Full Name Length Validation
ar: يجب ان يكون الاسم الكامل بين 1 الي 100 حرف.

source: Date Of Birth Validation
ar: تاريخ الميلاد مطلوب.

source: Date of Birth must be in the past
ar: يجب ان يكون تاريخ الميلاد في الماضي

source: Gender Validation
ar: النوع مطلوب.

source: Gender Validation correct Message
ar: النوع يجب ان يكون ذكر او انثى

source: Mobile Validation
ar: رقم الهاتف المحمول مطلوب.

source: Mobile Length Validation
ar: لا يجب ان يزيد رقم الهاتف المحمول عن 15 رقمة

source: Grade Level Validation
ar: يجب ان يكون المستوى بين 1 الي 12

source: CreateStudent
ar: اضافة طالب

source: CreateProfessor
ar: اضافة أستاذ

source: CreateCourse
ar: اضافة دورة

source: CreateDepartment
ar: اضافه قسم

source: Name Validation
ar: الاسم مطلوب

source: Name Length Validation
ar: يجب ان يكون الاسم بين 1 الي 100 حرف

source: Course Code Validation
ar: الكود مطلوب

source: Course Code Length Validation
ar: لا يجب ان يتعدى الكود 10 احرف

source: Course Credits Validation
ar: الاعتماد يجب ان يكون بين 1 الي 10.

source: Department Validation
ar: يجب ان تقوم بتحديد قسم.

source: Edit
ar: تعديل

source: Grade
ar: التقيم

source: EnrollmentDate
ar: تاريخ التقديم

source: Attendance
ar: الحضور

source: ViewAttendance
ar: الاطلاع على الحضور

source: Delete
ar: حذف

source: Course
ar: الدورة

source: DeleteStudent
ar: حذف طالب

source: Submit
ar: حفظ

source: Enrollments
ar: التسجيلات
